class Strings:
    HELLO_MSG = "Привет! 😊\nЭто AiCompanyAssistant!"

    HELP_MSG = "Напиши, пожалуйста, свои жизненные ценности!"

    WAIT_MSG = "Подождите, пожалуйста..."

    KEY_VALUES_ARE_NOT_DEFINED_MSG = "К сожалению, мне не удалось точно определить ваши ценности. Давайте попробуем обсудить это еще раз!"

    WAIT_URL_MSG = "Введите, пожалуйста, URL веб-сайта Вашей компании. Ничего больше вводить не нужно"

    WAIT_NAME_MSG = (
        "Введите, пожалуйста, имя Вашей компании. Ничего больше вводить не нужно"
    )

    NO_URL_MSG = "Извините, в вашем сообщении нет URL-адреса. Попробуйте ещё раз"

    URL_INVALID_MSG = "Ваш URL-адрес невалиден. Попробуйте ещё раз"

    BAD_NAME_MSG = (
        "Имя компании должно содержать только буквы, цифра, пробелы, дефисы и кавычки"
    )

    SHORT_NAME_MSG = "Имя компании должно иметь длину от 2 до 100 символов"

    ASSISTANT_CREATING_MSG = (
        "Принято! Ваш личный ассистент скоро будет создан. Ожидайте"
    )

    ASSISTANT_CREATED_MSG = "Ассистент для Вашей компании успешно создан! Пообщаться с ним вы сможете, перейдя по следующей ссылке: "

    ASSISTANT_HELLO_MSG = "Привет, коротко представься."

    ASSISTANT_ACTIVATED_MSG = "Ваш ассистент активирован!"

    ASSISTANT_IS_LOADING_MSG = "Ваш ассистент загружается. Пожалуйста, подождите."
