class Strings:
    """
    A class for storing strings of constants.
    """

    HELLO_MSG = "Привет! 😊\nЭто AiCompanyAssistant!"

    HELP_MSG = "Напиши, пожалуйста, свои жизненные ценности!"

    WAIT_MSG = "Подождите, пожалуйста...😇"

    CLEAR_MSG = "Ваш контекст успешно очищен!"

    KEY_VALUES_ARE_DEFINED = (
        "В ходе нашего обсуждения я выделила ваши следующие ценности: "
    )

    EMOTION_STATE_USER_ANS = "Сейчас я себя чувствую вот так: "

    KEY_VALUES_ARE_NOT_DEFINED = "К сожалению, мне не удалось точно определить ваши ценности. Давайте попробуем обсудить это еще раз!"

    WAIT_URL_MSG = "Введите, пожалуйста, URL веб-сайта Вашей компании. Ничего больше вводить не нужно"

    NO_URL = "Извините, в вашем сообщении нет URL-адреса. Попробуйте ещё раз"

    URL_INVALID = "Ваш URL-адрес невалиден. Попробуйте ещё раз"

    URL_CONNECTION_ERROR = (
        "Ошибка либо невозможность подключения к URL-адресу. Попробуйте ещё раз"
    )

    ASSISTANT_CREATED = "Ассистент для Вашей компании успешно создан! Пообщаться с ним вы сможете, перейдя по следующей ссылке: "
