class Strings:
    HELP_MSG = "Для активации функционала вашего персонального ассистента, выполните команду /start."

    WAIT_MSG = "Пожалуйста, ожидайте..."

    WAIT_URL_MSG = "Пожалуйста, введите URL веб-сайта вашей компании. Дополнительная информация не требуется."

    WAIT_NAME_MSG = "Пожалуйста, укажите название вашей компании."

    NO_URL_MSG = "Извините, в вашем сообщении нет URL-адреса. Попробуйте ещё раз."

    URL_INVALID_MSG = "Ваш URL-адрес невалиден. Попробуйте ещё раз."

    BAD_NAME_MSG = (
        "Имя компании должно содержать только буквы, цифра, пробелы, дефисы и кавычки."
    )

    SHORT_NAME_MSG = "Имя компании должно иметь длину от 2 до 100 символов."

    ASSISTANT_CREATING_MSG = (
        "Принято! Ваш личный ассистент скоро будет создан. Пожалуйста, ожидайте..."
    )

    ASSISTANT_CREATED_MSG = "Ассистент для Вашей компании успешно создан! Пообщаться с ним вы сможете, перейдя по следующей ссылке: "

    ASSISTANT_HELLO_MSG = "Привет, коротко представься (Обязательно скажи, какую компанию ты представляешь)."

    ASSISTANT_ACTIVATED_MSG = "Ваш ассистент активирован!"

    ASSISTANT_IS_LOADING_MSG = "Ваш ассистент загружается. Пожалуйста, подождите."

    ASSISTANT_IS_DEAD = (
        "Возникла ошибка: ассистент не сумел создаться. Пожалуйста, повторите попытку."
    )
