class Strings:
    """
    A class for storing strings of constants.
    """

    HELLO_MSG = "Привет! 😊\nЭто AiVoiceAssistant! Моя цель - выявить твои жизненные ценности. Я буду рада, если ты мне поможешь в этом."

    HELP_MSG = "Напиши, пожалуйста, свои жизненные ценности!"

    WAIT_MSG = "Подождите, пожалуйста...😇"

    CLEAR_MSG = "Ваш контекст успешно очищен!"

    KEY_VALUES_ARE_DEFINED = (
        "В ходе нашего обсуждения я выделила ваши следующие ценности: "
    )

    EMOTION_STATE_USER_ANS = "Сейчас я себя чувствую вот так: "

    KEY_VALUES_ARE_NOT_DEFINED = "К сожалению, мне не удалось точно определить ваши ценности. Давайте попробуем обсудить это еще раз!"
